{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "1d826de8-ee4e-4ccd-9c77-fba697aca74a",
   "metadata": {},
   "outputs": [],
   "source": [
    "#import libraries\n",
    "\n",
    "import pandas as pd\n",
    "from neo4j import GraphDatabase\n",
    "from tqdm import tqdm\n",
    "import warnings\n",
    "\n",
    "warnings.filterwarnings(\"ignore\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "05deb2d8-e80f-4bcd-8eed-8f243cbc9eaa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9276, 5)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>row_id</th>\n",
       "      <th>original_text</th>\n",
       "      <th>entity_text</th>\n",
       "      <th>entity_label</th>\n",
       "      <th>confidence</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>\\n    Patient Query:\\n    I woke up this morni...</td>\n",
       "      <td>panadol</td>\n",
       "      <td>medication</td>\n",
       "      <td>0.6307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0</td>\n",
       "      <td>\\n    Patient Query:\\n    I woke up this morni...</td>\n",
       "      <td>benign paroxysmal positional vertigo</td>\n",
       "      <td>medical_condition</td>\n",
       "      <td>0.7313</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0</td>\n",
       "      <td>\\n    Patient Query:\\n    I woke up this morni...</td>\n",
       "      <td>BPPV</td>\n",
       "      <td>medical_condition</td>\n",
       "      <td>0.5871</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0</td>\n",
       "      <td>\\n    Patient Query:\\n    I woke up this morni...</td>\n",
       "      <td>peripheral vertigo</td>\n",
       "      <td>medical_condition</td>\n",
       "      <td>0.5706</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0</td>\n",
       "      <td>\\n    Patient Query:\\n    I woke up this morni...</td>\n",
       "      <td>dizziness</td>\n",
       "      <td>symptom</td>\n",
       "      <td>0.8374</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   row_id                                      original_text  \\\n",
       "0       0  \\n    Patient Query:\\n    I woke up this morni...   \n",
       "1       0  \\n    Patient Query:\\n    I woke up this morni...   \n",
       "2       0  \\n    Patient Query:\\n    I woke up this morni...   \n",
       "3       0  \\n    Patient Query:\\n    I woke up this morni...   \n",
       "4       0  \\n    Patient Query:\\n    I woke up this morni...   \n",
       "\n",
       "                            entity_text       entity_label  confidence  \n",
       "0                               panadol         medication      0.6307  \n",
       "1  benign paroxysmal positional vertigo  medical_condition      0.7313  \n",
       "2                                  BPPV  medical_condition      0.5871  \n",
       "3                    peripheral vertigo  medical_condition      0.5706  \n",
       "4                             dizziness            symptom      0.8374  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "#load extracted entities dataset\n",
    "\n",
    "entity_df=pd.read_csv(\n",
    "    \"../Data/extracted_entities.csv\"\n",
    ")\n",
    "print(entity_df.shape)\n",
    "display(entity_df.head())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "e8aefbca-05d9-47c9-81d7-c540ee743442",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "load_dotenv()\n",
    "\n",
    "URI=os.getenv(\"NEO4J_URI\")\n",
    "USERNAME=os.getenv(\"NEO4J_USERNAME\")\n",
    "PASSWORD=os.getenv(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "03f3d5b2-4cb6-4063-b21c-4926cb9f4397",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "neo4j connected successfully\n"
     ]
    }
   ],
   "source": [
    "#create neo4j driver\n",
    "\n",
    "driver=GraphDatabase.driver(\n",
    "    URI,\n",
    "    auth=(USERNAME,PASSWORD)\n",
    ")\n",
    "\n",
    "print(\"neo4j connected successfully\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e043a0b6-ba18-486e-87f6-feb0bef9c6ff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Neo4j Connected\n"
     ]
    }
   ],
   "source": [
    "#test neo4j connection\n",
    "\n",
    "with driver.session() as session:\n",
    "\n",
    "    result=session.run(\n",
    "        \"RETURN 'Neo4j Connected' AS message\"\n",
    "    )\n",
    "\n",
    "    for record in result:\n",
    "\n",
    "        print(record[\"message\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6e9df0ac-61b8-46f5-825c-c5422f601797",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "constraints created\n"
     ]
    }
   ],
   "source": [
    "#create constraints\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.run(\"\"\"\n",
    "    CREATE CONSTRAINT symptom_name IF NOT EXISTS\n",
    "    FOR (s:Symptom)\n",
    "    REQUIRE s.name IS UNIQUE\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "    CREATE CONSTRAINT disease_name IF NOT EXISTS\n",
    "    FOR (d:Disease)\n",
    "    REQUIRE d.name IS UNIQUE\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "    CREATE CONSTRAINT medication_name IF NOT EXISTS\n",
    "    FOR (m:Medication)\n",
    "    REQUIRE m.name IS UNIQUE\n",
    "    \"\"\")\n",
    "print(\"constraints created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ed6b9df1-bdf3-4646-99cd-a52cfec64325",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(1915, 5)\n",
      "(1185, 5)\n",
      "(1656, 5)\n",
      "(1210, 5)\n"
     ]
    }
   ],
   "source": [
    "#separate entities\n",
    "\n",
    "symptoms=entity_df[\n",
    "    entity_df[\"entity_label\"]==\"symptom\"\n",
    "]\n",
    "\n",
    "diseases=entity_df[\n",
    "    entity_df[\"entity_label\"]==\"disease\"\n",
    "]\n",
    "\n",
    "medications=entity_df[\n",
    "    entity_df[\"entity_label\"]==\"medication\"\n",
    "]\n",
    "\n",
    "medical_conditions=entity_df[\n",
    "    entity_df[\"entity_label\"]==\"medical_condition\"\n",
    "]\n",
    "\n",
    "print(symptoms.shape)\n",
    "print(diseases.shape)\n",
    "print(medications.shape)\n",
    "print(medical_conditions.shape)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "01ed39cd-ed5a-4edd-8370-f050d8d2544a",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████████████████████████████████| 645/645 [00:06<00:00, 102.76it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "symptom nodes created\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "#create symptom nodes\n",
    "\n",
    "with driver.session() as session:\n",
    "    for symptom in tqdm(\n",
    "        symptoms[\"entity_text\"].unique()\n",
    "    ):\n",
    "        session.run(\"\"\"\n",
    "        MERGE (s:Symptom {\n",
    "            name:$name\n",
    "        })\n",
    "\n",
    "        \"\"\",\n",
    "        name=symptom.lower()\n",
    "        )\n",
    "print(\"symptom nodes created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c115af08-40e0-4ede-a94f-04ffac891a9b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████████████████████████████████| 608/608 [00:03<00:00, 158.17it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "disease nodes created\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "#create disease nodes\n",
    "\n",
    "with driver.session() as session:\n",
    "    for disease in tqdm(\n",
    "        diseases[\"entity_text\"].unique()\n",
    "    ):\n",
    "        session.run(\"\"\"\n",
    "        MERGE (d:Disease {\n",
    "            name:$name\n",
    "        })\n",
    "        \"\"\",\n",
    "        name=disease.lower()\n",
    "        )\n",
    "\n",
    "print(\"disease nodes created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c466ae8e-8e12-4bf9-affa-43add4c8faf6",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|█████████████████████████████████████████████████████████████████████████████| 1088/1088 [00:06<00:00, 169.25it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "medication nodes created\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "#create medication nodes\n",
    "\n",
    "with driver.session() as session:\n",
    "    for medication in tqdm(\n",
    "        medications[\"entity_text\"].unique()\n",
    "    ):\n",
    "        session.run(\"\"\"\n",
    "        MERGE (m:Medication {\n",
    "            name:$name\n",
    "        })\n",
    "        \"\"\",\n",
    "        name=medication.lower()\n",
    "        )\n",
    "\n",
    "print(\"medication nodes created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "393109af-d520-464e-8976-e8428695983a",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████████████████████████████████| 659/659 [00:05<00:00, 129.29it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "medical condition nodes created\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "#create medical condition nodes\n",
    "\n",
    "with driver.session() as session:\n",
    "    for condition in tqdm(\n",
    "        medical_conditions[\"entity_text\"].unique()\n",
    "    ):\n",
    "        session.run(\"\"\"\n",
    "        MERGE (c:MedicalCondition {\n",
    "            name:$name\n",
    "        })\n",
    "        \"\"\",\n",
    "        name=condition.lower()\n",
    "        )\n",
    "print(\"medical condition nodes created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "ac749273-2380-4e4e-b491-e7d645f46aae",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████████████████████████████████████████████████████████████████████████| 9276/9276 [03:14<00:00, 47.74it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "relationships created\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "#create symptom to disease relationships\n",
    "\n",
    "with driver.session() as session:\n",
    "    for index,row in tqdm(\n",
    "        entity_df.iterrows(),\n",
    "        total=len(entity_df)\n",
    "    ):\n",
    "        try:\n",
    "            row_id=row[\"row_id\"]\n",
    "            current_entity=row[\"entity_text\"].lower()\n",
    "            current_label=row[\"entity_label\"]\n",
    "            same_rows=entity_df[\n",
    "                entity_df[\"row_id\"]==row_id\n",
    "            ]\n",
    "            symptoms_in_row=same_rows[\n",
    "                same_rows[\"entity_label\"]==\"symptom\"\n",
    "            ]\n",
    "            diseases_in_row=same_rows[\n",
    "                same_rows[\"entity_label\"]==\"disease\"\n",
    "            ]\n",
    "            conditions_in_row=same_rows[\n",
    "                same_rows[\"entity_label\"]==\"medical_condition\"\n",
    "            ]\n",
    "            for _,symptom_row in symptoms_in_row.iterrows():\n",
    "                symptom_name=symptom_row[\n",
    "                    \"entity_text\"\n",
    "                ].lower()\n",
    "                for _,disease_row in diseases_in_row.iterrows():\n",
    "                    disease_name=disease_row[\n",
    "                        \"entity_text\"\n",
    "                    ].lower()\n",
    "                    session.run(\"\"\"\n",
    "                    MATCH (s:Symptom {\n",
    "                        name:$symptom\n",
    "                    })\n",
    "                    MATCH (d:Disease {\n",
    "                        name:$disease\n",
    "                    })\n",
    "                    MERGE (s)-[:RELATED_TO]->(d)\n",
    "                    \"\"\",\n",
    "                    symptom=symptom_name,\n",
    "                    disease=disease_name\n",
    "                    )\n",
    "                for _,condition_row in conditions_in_row.iterrows():\n",
    "                    condition_name=condition_row[\n",
    "                        \"entity_text\"\n",
    "                    ].lower()\n",
    "                    session.run(\"\"\"\n",
    "                    MATCH (s:Symptom {\n",
    "                        name:$symptom\n",
    "                    })\n",
    "                    MATCH (c:MedicalCondition {\n",
    "                        name:$condition\n",
    "                    })\n",
    "                    MERGE (s)-[:RELATED_TO]->(c)\n",
    "                    \"\"\",\n",
    "                    symptom=symptom_name,\n",
    "                    condition=condition_name\n",
    "                    )\n",
    "        except Exception as e:\n",
    "            print(e)\n",
    "print(\"relationships created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e2dd73fb-813e-406a-a6ee-567c9694f5ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|█████████████████████████████████████████████████████████████████████████████| 9276/9276 [01:31<00:00, 101.61it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "medication relationships created\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "#create medication relationships\n",
    "\n",
    "with driver.session() as session:\n",
    "    for index,row in tqdm(\n",
    "        entity_df.iterrows(),\n",
    "        total=len(entity_df)\n",
    "    ):\n",
    "        try:\n",
    "            row_id=row[\"row_id\"]\n",
    "            same_rows=entity_df[\n",
    "                entity_df[\"row_id\"]==row_id\n",
    "            ]\n",
    "            conditions=same_rows[\n",
    "                same_rows[\"entity_label\"]==\"medical_condition\"\n",
    "            ]\n",
    "            medications=same_rows[\n",
    "                same_rows[\"entity_label\"]==\"medication\"\n",
    "            ]\n",
    "            for _,condition_row in conditions.iterrows():\n",
    "                condition_name=condition_row[\n",
    "                    \"entity_text\"\n",
    "                ].lower()\n",
    "                for _,medication_row in medications.iterrows():\n",
    "                    medication_name=medication_row[\n",
    "                        \"entity_text\"\n",
    "                    ].lower()\n",
    "                    session.run(\"\"\"\n",
    "                    MATCH (c:MedicalCondition {\n",
    "                        name:$condition\n",
    "                    })\n",
    "                    MATCH (m:Medication {\n",
    "                        name:$medication\n",
    "                    })\n",
    "                    MERGE (c)-[:TREATED_BY]->(m)\n",
    "                    \"\"\",\n",
    "\n",
    "                    condition=condition_name,\n",
    "                    medication=medication_name\n",
    "                    )\n",
    "        except Exception as e:\n",
    "            print(e)\n",
    "\n",
    "print(\"medication relationships created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "b5d5b17e-e609-4a69-b2c2-968c09df26ae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total Nodes: 2728\n"
     ]
    }
   ],
   "source": [
    "#count graph nodes\n",
    "\n",
    "with driver.session() as session:\n",
    "    result=session.run(\"\"\"\n",
    "    MATCH (n)\n",
    "    RETURN count(n) AS total_nodes\n",
    "\n",
    "    \"\"\")\n",
    "\n",
    "    for record in result:\n",
    "        print(\n",
    "            \"Total Nodes:\",\n",
    "            record[\"total_nodes\"]\n",
    "        )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "dd96d990-3b79-4759-b42d-0f7206edae00",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total Relationships: 3516\n"
     ]
    }
   ],
   "source": [
    "#count graph relationships\n",
    "\n",
    "with driver.session() as session:\n",
    "    result=session.run(\"\"\"\n",
    "    MATCH ()-[r]->()\n",
    "    RETURN count(r) AS total_relationships\n",
    "    \"\"\")\n",
    "    for record in result:\n",
    "        print(\n",
    "            \"Total Relationships:\",\n",
    "            record[\"total_relationships\"]\n",
    "        )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "f09395b1-33cc-477b-8d2e-51c28907ba5b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "dizziness -> osteoporosis\n",
      "dizziness -> cancer\n",
      "dizziness -> cervical spondylosis\n",
      "dizziness -> breast cancers\n",
      "dizziness -> isthmic spondylolisthesis\n",
      "dizziness -> islamic spondylolisthesis\n",
      "dizziness -> asthma\n",
      "dizziness -> cardiac disease\n",
      "dizziness -> diabetic\n",
      "dizziness -> kidney infection\n"
     ]
    }
   ],
   "source": [
    "#sample graph query\n",
    "\n",
    "with driver.session() as session:\n",
    "    result=session.run(\"\"\"\n",
    "    MATCH (s:Symptom)-[:RELATED_TO]->(d)\n",
    "    RETURN s.name AS symptom,\n",
    "           d.name AS disease\n",
    "    LIMIT 10\n",
    "    \"\"\")\n",
    "    for record in result:\n",
    "        print(\n",
    "            record[\"symptom\"],\n",
    "            \"->\",\n",
    "            record[\"disease\"]\n",
    "        )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "3952e956-7093-4016-837a-a14904037d3e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "neo4j connection closed\n"
     ]
    }
   ],
   "source": [
    "#close neo4j connection\n",
    "\n",
    "driver.close()\n",
    "\n",
    "print(\"neo4j connection closed\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8eecaa6d-dd01-487f-a2e0-068a756d781c",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
